tap "buildkite/buildkite"
tap "elastic/elastic-eng-internal"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Rainbows and unicorns in your console!
brew "lolcat"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cross-shell prompt for astronauts
brew "starship"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# Terminal multiplexer
brew "tmux"
# Subversion-like utility to work with Jackrabbit FileVault
brew "vault-cli"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Work with Buildkite from the command-line
brew "buildkite/buildkite/bk@3", trusted: true
# devctl, the CLI for creating and interacting with ECP development environments.
brew "elastic/elastic-eng-internal/devctl", trusted: true
# Terminal-based AI coding assistant
cask "claude-code"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Utility to support moving and resizing using a modifier key and mouse drag
cask "easy-move+resize"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "anthropic.claude-code"
vscode "golang.go"
vscode "ms-vscode.makefile-tools"
go "golang.org/x/tools/gopls"
go "github.com/elastic/service-placement/cmd/cli"
